app/views/pages/home.html.erb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT COUNT(*) FROM "posts"
---
        <div class="col-sm-6" style="fontsize:80%; opacity:0.7;" >Tweets<br>
        <p style="color:blue; font-size:100%;opacity:1.2;"><%= current_user.posts.count %></p>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
           <div class="col-sm-11">
          <p class="post-content"> <small><b><%= User.find(@p.user_id).username%>- <%= @p.created_at.to_formatted_s(:short)%></b></b></small><br>