app/views/pages/profile.html.erb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "hello"], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE (user_id = 2) ORDER BY "posts"."created_at" DESC
---
           <div class="col-sm-11">
          <p class="post-content"> <small><b><%= User.find(@p.user_id).username%>- <%= @p.created_at.to_formatted_s(:short)%></b></b></small><br>