app/controllers/pages_controller.rb

SELECT  "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 5], ["OFFSET", 5]]
---
  def home
     @posts= Post.all.page(params[:page]).per(5)

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "hello"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE (user_id = 2) ORDER BY "posts"."created_at" DESC
---
  def profile
    if (User.find_by_username(params[:id]))
  @username = params[:id]
  else
   redirect_to root_path, :notice=> "User not found!"
    end

    @posts= Post.all.where("user_id=?", User.find_by_username(params[:id]).id)

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  def Explore
     @posts= Post.all